#+title: notes on head first go


#+begin_src go
   package main

   import "fmt"

   func main() {
	   fmt.Println("Hello, Go")
  }

#+end_src

#+RESULTS:
: Hello, Go
